tutorials/change_boundaryconditions/pitzDaily2/0/U
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
version     2.0;
format      ascii;
class       volVectorField;
object      U;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 1 -1 0 0 0 0];

internalField   uniform (0 0 0);

boundaryField
{
inlet
{
type            fixedValue;
value           uniform (12 0 0);
}

outlet
{
type pressureInletOutletVelocity;
 value uniform (0 0 0);
}

upperWall
{
type            noSlip;
}

lowerWall
{
type            noSlip;
}

frontAndBack
{
type            empty;
}
}

// ************************************************************************* //
